app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2021-01-13 19:51:23.604710"], ["updated_at", "2021-01-13 19:51:23.604710"]]
---
  def create
    @article = Article.new
    @article.title = params[:article][:title]
    @article.description = params[:article][:description]
    @article.save